# Introduction to Pandas

For doing data analysis and manipulation in Python, Pandas is one of the most powerful, resourceful and intuituve packages. It consists of data structures and functions and can assist us with doing a huge set of tasks for analytical work. In order to use these resources in our script, Pandas needs to be loaded using the **import** command, as shown below. We can also define an alias for Pandas (we used pd) as we are going to use Pandas' modules multiple times in our code.

<img src="https://pandas.pydata.org/docs/_static/pandas.svg" width="200"/>

Pandas enables us to work with data structures, a special form of storage to store and process data. For example, a DataFrame (to be discussed below) is a data structure to store data in a format similar to an Excel spreadsheet. We can create a DataFrame to store a dataset in form of a table and this DataFrame will have multiple methods and functions that operate on it to process the data it stores.

Pandas comes usually installed with Jupyter environments like the one you are using here. If Pandas is installed, you can check the current version of Pandas by using the ```pd.__version__``` command after the import command below:

*Note: pd is an alias for pandas*

In [1]:
import pandas as pd
pd.__version__

'1.4.2'

### Data Structures in Pandas

We will learn the 2 fundamental data structures in Pandas: **Series** and **DataFrames**. 

![](images/series.png)

**Series** is a one-dimensional data structure which can hold data of multiple types. Series are labelled where an index labels each element inside a series. Series can be created out from a Python list, a Python dictionary or even a scalar value. A particular Pandas Series can hold only a single data type.

Below, we will go through 2 of the ways to create a Pandas Series. The method below creates a Series out of a Python dictionary.

In [2]:
sample_dictionary = {'Mercury': 35, 'Venus': 67, 'Earth': 93}

sample_series = pd.Series(sample_dictionary)

Note: Typing and running the data structure name on a Jupyter cell displays the elements of the data structure.

In [3]:
# Print the series
sample_series

Mercury    35
Venus      67
Earth      93
dtype: int64

The keys in the dictionary becomes the index of the element in the Series, whereas, the values are the data stored in the Series as it's elements.

Note: if we do not specify the index, the default numeric range (from 0 till length of all elements) will be given.

We will now create a Series from a list, without giving the index. In the cell after that, we will provide the index while we create a Series out of a list.

In [4]:
sample_list = [35, 67, 93]

sample_series = pd.Series(sample_list)

sample_series

0    35
1    67
2    93
dtype: int64

In [5]:
sample_series = pd.Series(sample_list, index = ['Mercury', 'Venus', 'Earth'])

sample_series

Mercury    35
Venus      67
Earth      93
dtype: int64

<hr style="border:2px solid gray">

Unlike Series, **DataFrames** are multi-dimensional, primarily consisting of rows and columns. They are similar to a spreadsheet or a SQL table. Pandas provides all functionalities and methods to deal with data in the DataFrame. Each row in a DataFrame is labeled with an index, as it is done in Series. Whereas, there are also labels for each column. In one of upcoming sections, we will also have a look at multi-level indexing for DataFrames.

![](images/dataframe.png)

There are several ways to create or form a DataFrame. A DataFrame can be created from combining multiple Series. It can also be formed out of Python lists and dictionaries. In the first cell, we will create a DataFrame using a Dictionary of lists. 

In the examples below, we are creating data for site views (in thousands) on a website per browser every year.

In [6]:
web_views = pd.DataFrame({
    'Chrome': [67, 74, 89],
    'Safari': [44, 58, 70],
    'Firefox': [8, 14, 16]
}, index = [2018, 2019, 2020])

web_views

      Chrome  Safari  Firefox
2018      67      44        8
2019      74      58       14
2020      89      70       16

Below we will create a DataFrame using a list of dictionaries.

In [7]:
web_views = pd.DataFrame(
    [{"Chrome": 67, "Safari": 44, "Firefox":8 }, 
     {"Chrome": 74, "Safari": 58, "Firefox": 14},
    {"Chrome": 89, "Safari": 70, "Firefox": 16}]
)

web_views

   Chrome  Safari  Firefox
0      67      44        8
1      74      58       14
2      89      70       16

**Note**: If we do not provide the index, Pandas uses the default index: a list of integers beginning from 0 to length of the dataframe.

In the following cell we will create a DataFrame using a 2 dimensional list.

In [8]:
web_views = pd.DataFrame(
    [[67, 74, 89],
     [44, 58, 70],
     [8, 14, 16]],
    index = [2018, 2019, 2020], columns = ["Chrome", "Safari", "Firefox"]
)

web_views

      Chrome  Safari  Firefox
2018      67      74       89
2019      44      58       70
2020       8      14       16

### Files in Pandas

Pandas offers reader functions which can read in a data file and enable us to store it in a Pandas data structure. The most useful one `read.csv()` will read a text file and convert it to a DataFrame (primarily used for reading comma-separated files). Pandas also offers `read_json()` and `read_excel` to read json and excel files, respectively, 2 of the most common file types for data.

We will use the `read.csv` function to read the Chicago Police Traffic Stops data.

In [9]:
stops_df = pd.read_csv('TrafficStopsChicago.csv')

The [documentation](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html) provides great detail of the arguments that `read_csv()` function accepts. Some of the common ones that you must know are:

**filepath_or_buffer**: Either a path to a file or URL.
<br>**sep**: Delimiter to use. Default delimiter is `','` (for comma-separated files. Use `'\t'` for tab-separated files, tsv)

For a large DataFrame, typing and running the DataFrame name on a Jupyter cell displays the dataset with truncated rows and columns.

In [10]:
stops_df

,DateStop,TimeStop,Duration,City,DriverRace,TypeOfMovingViolation,Beat,ContraFound,DrugsFound,WeaponFound
0,2021-01-01,0:33,5,CHICAGO,4.0,NaN,1234,0,0,0
1,2021-01-01,1:50,4,CHICAGO,2.0,NaN,1122,0,0,0
2,2021-01-01,8:50,4,CHICAGO,2.0,NaN,332,0,0,0
3,2021-01-01,12:41,6,CHICAGO,2.0,NaN,1121,0,0,0
4,2021-01-01,13:51,5,CHICAGO,2.0,NaN,423,0,0,0
...,...,...,...,...,...,...,...,...,...,...
76275,2021-02-28,20:34,9,CHICAGO,4.0,4.0,1533,0,0,0
76276,2021-02-28,20:06,4,CHICAGO,2.0,NaN,214,0,0,0
76277,2021-02-28,21:47,4,SAINT PAUL,2.0,NaN,1821,0,0,0
76278,2021-02-28,21:15,5,CHICAGO,2.0,NaN,331,0,0,0
76279,2021-02-28,21:15,4,CHICAGO,4.0,NaN,1033,0,0,0

This dataset is huge! Pandas also offers methods to view a small sample of a Series or a DataFrame. The `head()` and `tail()` methods enable us to do that. They show us the first set of rows and the last set of rows, respectively. By default, they display 5 rows. The argument to these methods can be changed to the number of rows needed to be displayed.

In [11]:
# View first 5 rows
stops_df.head()

,DateStop,TimeStop,Duration,City,DriverRace,TypeOfMovingViolation,Beat,ContraFound,DrugsFound,WeaponFound
0,2021-01-01,0:33,5,CHICAGO,4.0,NaN,1234,0,0,0
1,2021-01-01,1:50,4,CHICAGO,2.0,NaN,1122,0,0,0
2,2021-01-01,8:50,4,CHICAGO,2.0,NaN,332,0,0,0
3,2021-01-01,12:41,6,CHICAGO,2.0,NaN,1121,0,0,0
4,2021-01-01,13:51,5,CHICAGO,2.0,NaN,423,0,0,0

In [12]:
# View last 3 rows
stops_df.tail(3)

,DateStop,TimeStop,Duration,City,DriverRace,TypeOfMovingViolation,Beat,ContraFound,DrugsFound,WeaponFound
76277,2021-02-28,21:47,4,SAINT PAUL,2.0,NaN,1821,0,0,0
76278,2021-02-28,21:15,5,CHICAGO,2.0,NaN,331,0,0,0
76279,2021-02-28,21:15,4,CHICAGO,4.0,NaN,1033,0,0,0

### Basic metadata

Pandas enables us to access basic metadata (supplementary data that gives information about the main dataset) for its data structures by using some functions (also referred as attributes). The important ones that we are going to learn here are **shape**, **dtypes** and axis labels.

**Shape** gives the axis dimensions of the data structure. For a DataFrame, it will give the number of rows and columns.

In [13]:
stops_df.shape

(76280, 10)

**dtypes** will give the data type for each column in a DataFrame. We are going to learn more about data types in the upcoming sections.

In [14]:
stops_df.dtypes

DateStop                  object
TimeStop                  object
Duration                   int64
City                      object
DriverRace               float64
TypeOfMovingViolation    float64
Beat                       int64
ContraFound                int64
DrugsFound                 int64
WeaponFound                int64
dtype: object

Pandas data structures have axis labels. We have seen that each element in a Series is labeled using an index. Whereas, a DataFrame has a set of labels for each row and another set for columns. We can access these labels for a DataFrame using `.index` and `.columns` attributes.

In [15]:
stops_df.columns

Index(['DateStop', 'TimeStop', 'Duration', 'City', 'DriverRace',
       'TypeOfMovingViolation', 'Beat', 'ContraFound', 'DrugsFound',
       'WeaponFound'],
      dtype='object')

In [16]:
stops_df.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            76270, 76271, 76272, 76273, 76274, 76275, 76276, 76277, 76278,
            76279],
           dtype='int64', length=76280)

As you can notice, since there wasn't any index provided by the dataset, Pandas sets the default index to a range of integers from 0 to length of the DataFrame.

### Selecting and Subsetting

Pandas offers a few ways that we can use to select a set of data. This includes selecting a cell, row, column or a subset of the entire dataframe. The 3 ways that we will go through include: selection using `[]`, `.loc` (label based indexing) and `.iloc` (position based indexing).

Using `[]` is an archaic way of indexing which mimics the same way we would index dictionaries in Python. In Pandas, it will select the lower-dimension. For the Series below, we are using the row index to select a row below.

In [17]:
sample_series['Mercury']

35

Similarly, we can use this notation to index a column in a DataFrame. This will result in a Series.

In [18]:
web_views['Chrome']

2018    67
2019    44
2020     8
Name: Chrome, dtype: int64

While you may still find the use of this notation for indexing DataFrames and Series, it can often result in errors and ambiguity. The purpose to bring it up here was to provide familiarity with this notation. Therefore, we will focus more on using `.loc` for selection as it is a powerful and explicit indexer. The format it follows is `.loc[row_indexer,col_indexer]`

The integer below is the label for the index that will extract the row with index label 2.

In [19]:
stops_df.loc[2]

DateStop                 2021-01-01
TimeStop                       8:50
Duration                          4
City                        CHICAGO
DriverRace                      2.0
TypeOfMovingViolation           NaN
Beat                            332
ContraFound                       0
DrugsFound                        0
WeaponFound                       0
Name: 2, dtype: object

We can also print out a set of rows using slices. `:2` refers to index in the the range 0 to 2, a shorthand for `0:2`. 

Note that the index labels are interger in this DataFrame. This method also works well with non-integer index. For eg. we can also use slicing for sting labels. In that case, pandas will return all the rows in between the rows whose labels are specified in the slice, including the specified rows as well.

In [20]:
stops_df.loc[:2]

,DateStop,TimeStop,Duration,City,DriverRace,TypeOfMovingViolation,Beat,ContraFound,DrugsFound,WeaponFound
0,2021-01-01,0:33,5,CHICAGO,4.0,NaN,1234,0,0,0
1,2021-01-01,1:50,4,CHICAGO,2.0,NaN,1122,0,0,0
2,2021-01-01,8:50,4,CHICAGO,2.0,NaN,332,0,0,0

Using the `.loc` selector, we can also select the second dimension (column for a DataFrame). In the cell below, we are selecting all rows and the 'City' column.

In [21]:
stops_df.loc[: ,'City']

0           CHICAGO
1           CHICAGO
2           CHICAGO
3           CHICAGO
4           CHICAGO
            ...
76275       CHICAGO
76276       CHICAGO
76277    SAINT PAUL
76278       CHICAGO
76279       CHICAGO
Name: City, Length: 76280, dtype: object

By specifying a single value in both the dimensions, we can select the specific cell as well.

In [22]:
stops_df.loc[5 ,'City']

'CHICAGO'

Or select a range of rows over multiple columns.

In [23]:
stops_df.loc[55:60, ['City','DriverRace']]

          City  DriverRace
55    MAYWOOD          2.0
56     CHICAGO         2.0
57     CHICAGO         2.0
58  FORES PARK         2.0
59   BELVIDERE         2.0
60     CHICAGO         1.0

The selection can also be a list of indices rather than a range.

In [24]:
stops_df.loc[[55,78,903], ['City','DriverRace']]

         City  DriverRace
55   MAYWOOD          2.0
78    CHICAGO         4.0
903   CHICAGO         1.0

Another useful approach that comes handy when performing data manipulation operations is selection using boolean operators. In the cell below, before the comparision operator, we are subsetting the DataFrame to return all rows in the 'Duration' column. We are then comparing the 'Duration' value and returning `True` if the value is strictly less than 5. This returns a boolean Series.

In [25]:
stops_df.loc[:, 'Duration'] < 5

0        False
1         True
2         True
3        False
4        False
         ...
76275    False
76276     True
76277     True
76278    False
76279     True
Name: Duration, Length: 76280, dtype: bool

The above comparision operation can then be used to filter out rows that are True for the above case. In the cell below, we are using the same comparision operation to return cells from the entire DataFrame that have a stop duration of less than 5. Notice, we are then subsetting it to only provide City Names of rows that pass that condition.

In [26]:
stops_df.loc[stops_df.loc[:,'Duration'] < 5, 'City']

1                 CHICAGO
2                 CHICAGO
5                 CHICAGO
8        GLENDALE HEIGHTS
9                 CHICAGO
               ...
76270             CHICAGO
76272             CHICAGO
76276             CHICAGO
76277          SAINT PAUL
76279             CHICAGO
Name: City, Length: 40558, dtype: object

Another form of selection that we introduced is Selection by Position using `.iloc`. This attribute is a form of indexing using integers that mark position of the cell.

In [27]:
stops_df.iloc[8]

DateStop                       2021-01-01
TimeStop                            17:26
Duration                                2
City                     GLENDALE HEIGHTS
DriverRace                            5.0
TypeOfMovingViolation                 6.0
Beat                                 1824
ContraFound                             0
DrugsFound                              0
WeaponFound                             0
Name: 8, dtype: object

In the case of this dataset, index labels are sorted integers which is the same as the index position as well, therefore, in this specific case, using either `.loc` or `.iloc` will return the same set of rows. However, since we have string labels for each column, we will have to provide integer values that mark the position of the column in the DataFrame. Providing column name or any non-integer value in `.iloc` will return an error.

In the cell below, we are selecting rows 2 till 6, with 2 included, and selecting the 4th column ('Duration' is at position 4).

In [28]:
stops_df.iloc[2:6, 4]

2    2.0
3    2.0
4    2.0
5    2.0
Name: DriverRace, dtype: float64

We can also select a range for rows as well as for columns.

In [29]:
stops_df.iloc[2:6, 4:8]

   DriverRace  TypeOfMovingViolation  Beat  ContraFound
2         2.0                    NaN   332            0
3         2.0                    NaN  1121            0
4         2.0                    NaN   423            0
5         2.0                    NaN   423            0

**Note**: Out of range slice indexes are handled gracefully. It will not return an error but will return everything in the range apart from the out of range slices. If the entire slice index is out of range, Python will return empty list.

### Data types and conversion

We saw above how the attribute `dtypes` provides us with the the data type for each column in a DataFrame. Pandas has a set of data types that it understands and manipulates. We will touch upon the most basic and common ones that you saw in the result returned from running the command `stops_df.dtypes`. In brief, they include:

- integer: default integer types are int64 (called nullable integers too)
- float: default float types are float64
- boolean: stores boolean data (True/False) with missing values
- date/time: stores dates in datetime64[ns] format
- object:  holds any Python object, including strings
- string: dedicated to strings
- category: stores limited, fixed number of possible values

We can print the data types for the stops DataFrame again and can see that by default, Pandas doesn't interpret all data types in the form that can be useful for us. For eg. DateStop and TimeStop are object types (stored as strings) and will prevent us from performing several temporal operations. (We will cover datetime in detail in the following section)

Similarly, DriverRace and ReasonStop, which indicates the category of the Driver's Race and Reason for Stop, respectively, are not given the correct type. Since these categories are assigned float and integer, respectively, this can mislead our analytical process and any prediction we might want to make.

In [30]:
stops_df.dtypes

DateStop                  object
TimeStop                  object
Duration                   int64
City                      object
DriverRace               float64
TypeOfMovingViolation    float64
Beat                       int64
ContraFound                int64
DrugsFound                 int64
WeaponFound                int64
dtype: object

The `astype` function enables us to convert data types to the desired ones. A convenient way of performing this operation is to pass a dictionary with the column name, whose type needs to be changed, as a key and the desired data type as value. We will then assign the returned result to the original DataFrame to replace it with these new changes.

In [31]:
stops_df = stops_df.astype({'DriverRace': 'category', 
                            'TypeOfMovingViolation':'category',
                            'Beat':'category',
                            'ContraFound':'category',
                            'DrugsFound':'category',
                            'WeaponFound':'category'})

Let's use `dtypes` to check the new assigned data types

In [32]:
stops_df.dtypes

DateStop                   object
TimeStop                   object
Duration                    int64
City                       object
DriverRace               category
TypeOfMovingViolation    category
Beat                     category
ContraFound              category
DrugsFound               category
WeaponFound              category
dtype: object

### Datetime in Pandas

Temporal data (consisting of date and time stamps) is highly common in data analytics and can be processed to create useful features. Pandas offers the ability to work with time series information in various formats. This can enable us to perform several operations on datetime values such as sorting, predicting or categorizing data by certain time periods.

A convenient format for date and time data that Pandas uses is datetime from Python's [datetime](https://docs.python.org/3/library/datetime.html) library. This provides the ability for manipulating dates and times. We will work with datetime.datetime type from this library, which is a combination of both date and time. Pandas will assign either datetime64[ns] or datetime64[ns, tz] data type to such a format.

Series and DataFrame have extended data type support and functionality for datetime. In order to create this format from a Series or list consisting of timestamps in String or Object form (as is in the case of `stops_df` dataframe), we will use Pandas' `.to_datetime()` function. A single scalar value will be converted to Timestamp data type, whereas, in a Series, the Pandas object data type will convert to datetime64[ns].

In [33]:
# converting a single scalar value
pd.to_datetime("2010/11/12")

Timestamp('2010-11-12 00:00:00')

Using this function on the stops DataFrame will result in Pandas parsing it to datetime.datetime like format. You can notice the data type it gets converted into at the bottom of the output.

In [34]:
pd.to_datetime(stops_df.loc[:,'DateStop'])

0       2021-01-01
1       2021-01-01
2       2021-01-01
3       2021-01-01
4       2021-01-01
           ...
76275   2021-02-28
76276   2021-02-28
76277   2021-02-28
76278   2021-02-28
76279   2021-02-28
Name: DateStop, Length: 76280, dtype: datetime64[ns]

We will now assign it back to the original DataFrame. The `.to_datetime()` function also enables to pass a format argument to ensure specific parsing. This could also potentially speed up the conversion. You can find the format codes on this [link](https://docs.python.org/3/library/datetime.html#strftime-and-strptime-format-codes).

In [35]:
stops_df.loc[:,'DateStop'] = pd.to_datetime(stops_df.loc[:,'DateStop'], 
                                            format="%Y-%m-%d")

Every Timestamp has a set of time/date properties or temporal features that can be extracted.

For a Series of type datetime, we can use the .dt accessor to extract these properties. This [table](https://pandas.pydata.org/docs/user_guide/timeseries.html#time-date-components) lists all the properties that can be accessed. We will use it to get the day of the week (to classify if the stop was on a weekend or a weekday). We will assign it to a new column in the DataFrame.

In [36]:
stops_df.loc[:,'Weekday'] = stops_df.loc[:,'DateStop'].dt.weekday

We will now see the values returned from the timestamp in DATESTOP column for some randomly selected rows.

In [37]:
stops_df.loc[[1,44,5400,10434,55400], ['DateStop','Weekday']]

        DateStop  Weekday
1     2021-01-01        4
44    2021-01-01        4
5400  2021-02-06        5
10434 2021-01-05        1
55400 2021-02-20        5

Similarly, we can convert the TimeStop variable's 'object' data type to datetime type. The `.to_datetime()` function will also prefix a specific date to it since this column doesn't contain one. We will extract the time out from it using the `.dt` accessor. We will also use this accessor to create hour of the day variable.

In [38]:
pd.to_datetime(stops_df.loc[:,'TimeStop'], format="%H:%M")

0       1900-01-01 00:33:00
1       1900-01-01 01:50:00
2       1900-01-01 08:50:00
3       1900-01-01 12:41:00
4       1900-01-01 13:51:00
                ...
76275   1900-01-01 20:34:00
76276   1900-01-01 20:06:00
76277   1900-01-01 21:47:00
76278   1900-01-01 21:15:00
76279   1900-01-01 21:15:00
Name: TimeStop, Length: 76280, dtype: datetime64[ns]

In [39]:
stops_df.loc[:, 'Time'] = pd.to_datetime(stops_df.loc[:, 'TimeStop'], format="%H:%M").dt.time
stops_df.loc[:, 'Hour'] = pd.to_datetime(stops_df.loc[:, 'TimeStop'], format="%H:%M").dt.hour

We will print the first 5 rows to see if the hour corresponds with the time.

In [40]:
stops_df.loc[:5, ['Time','Hour']]

       Time  Hour
0  00:33:00     0
1  01:50:00     1
2  08:50:00     8
3  12:41:00    12
4  13:51:00    13
5  13:48:00    13

### Missing Values

Dealing with missing values is a major component of the data cleaning process. Fortunately, Pandas has a set of markers and methods to help us do that. Primarily, Pandas uses NaN as the default missing value marker and this can be used as a marker for different data types.

Pandas offers a set of methods to detect, fill or replace NaN values. Moreover, NaNs can also be ignored in Pandas function by specifying to ignore NaNs in the function arguments, if possible. Therefore, it is handy to convert any value indicating a missing value to a NaN.

In order to check for NaN in a DataFrame or Series, we can use `.isna()` or `.notna()` attribute.

In [41]:
stops_df.isna().head()

,DateStop,TimeStop,Duration,City,DriverRace,TypeOfMovingViolation,Beat,ContraFound,DrugsFound,WeaponFound,Weekday,Time,Hour
0,False,False,False,False,False,True,False,False,False,False,False,False,False
1,False,False,False,False,False,True,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False,False,False,False
3,False,False,False,False,False,True,False,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,False,False,False

Using `.notna()` will reverse the results. As you can notice above, we can find missing values in the column 'TypeOfMovingViolation' just by having a slight glimpse over the Dataframe. In order to count the total missing values in all columns, we can suffix it with a method `.sum()` which adds all cells where value is True (where each True is 1).

In [42]:
stops_df.isna().sum()

DateStop                     0
TimeStop                     0
Duration                     0
City                         0
DriverRace                   3
TypeOfMovingViolation    53326
Beat                         0
ContraFound                  0
DrugsFound                   0
WeaponFound                  0
Weekday                      0
Time                         0
Hour                         0
dtype: int64

One of the ways to deal with these missing values is to fill in the NaNs with a scaler value using `.fillna()`. Here, the method accepts the value to be replaced. The inplace argument, when set to True, applies the changes to the DataFrame.

However, for the case of any column or Series with dtype 'category', we need to make sure that the value we are replacing with is part of the category list. Therefore, before we fill the missing value using `.fillna()`, we will add the value to the category list of the column using `.cat.add_categoires()`.

In [43]:
stops_df.loc[:,'TypeOfMovingViolation'] = \
stops_df.loc[:, 'TypeOfMovingViolation'].cat.add_categories(0.0)

stops_df.loc[:, 'TypeOfMovingViolation'].fillna(0.0, inplace = True)

Another way is to simply exclude rows or columns from a dataset that might contain missing values. We need to be very careful when deciding to use this approach since we might lose critical data or reduce the data size.

In case we plan to, `dropna()` will do the job for us. By specifying the axis in the argument (either 'index' or 'columns'), the specified axis containing atleast one NaN will be removed.

We will use it below to remove the rows where the Driver's Race is missing since that is the key component for our analysis. We specify the column name as the subset argument to only remove rows where 'DriveRace' is missing.

In [44]:
stops_df.dropna(axis='index', 
                subset=['DriverRace'], 
                inplace=True)

### Mapping/Replacing values and labels

Data cleaning process usuallly requires replacing vague, misspelled or missing values with correct ones. It also requires structuring the index and column labels properly in order to make it easier for analysis.

In order to rename index labels or columns, the rename method is very useful. By mapping the existing value to a new one, we can replace the column name. In the method below, the existing column name is provided as they key of a dictionary and the new column name as the value.

In [45]:
stops_df.rename(columns={"Beat": "BeatCode"}, 
                inplace= True)

We can also drop columns and rows that are not needed. The drop function will remove column or row that is specified in arguments. To drop rows using their index, you can replace 'columns' with 'index' and pass it a single index name or a list of them.

In [46]:
stops_df.drop(columns='TimeStop', inplace=True)

The columns attribute will enable us to verify the changes made.

In [47]:
stops_df.columns

Index(['DateStop', 'Duration', 'City', 'DriverRace', 'TypeOfMovingViolation',
       'BeatCode', 'ContraFound', 'DrugsFound', 'WeaponFound', 'Weekday',
       'Time', 'Hour'],
      dtype='object')

To change any cell's value, we can use `.loc()` and `.iloc` as shown below.

In [48]:
stops_df.loc[230, 'City'] = 'Chicago'

However, value replacement, particularly for data cleaning purposes, is usually applied on a set of values combined. For such purposes, Pandas provides the map method that maps value in a Series (or a column in a DataFrame) to a given set of values. 

In the cell below, we are using the map method to convert the categorical values of race in numerical form to the actual race title in string as provided in the data dictionary. Note that we are using a dictionary where the key is the existing value and the value is the new string we want to replace it with. Providing a dictionary for mapping is the most convenient way, however, map method takes other forms of inputs too.

In [49]:
stops_df.loc[:, 'DriverRace'] = stops_df.loc[:, 'DriverRace'].map({
    1.0: 'White',
    2.0: 'Black or African American',
    3.0: 'American Indian or Alaska Native',
    4.0: 'Hispanic or Latino',
    5.0: 'Asian',
    6.0: 'Native Hawaiian or Other Pacific Islander',
})

Similarly, we will map the numeric values in column 'TypeOfMovingViolation' to its respective category.

In [50]:
stops_df.loc[:, 'TypeOfMovingViolation'] = stops_df.loc[:, 'TypeOfMovingViolation'].map({
    0.0: 'No Violation',
    1.0: 'Speed',
    2.0: 'Lane Violation',
    3.0: 'Seat Belt',
    4.0: 'Traffic Sign or Signal',
    5.0: 'Follow too close',
    6.0: 'Other',
})

We will also map the categories in other categorical variables for to simplify the analysis ahead.

In [51]:
stops_df.loc[:, 'ContraFound'] = stops_df.loc[:, 'ContraFound'].map({
    0.0: 'NA',
    1.0: 'Yes',
    2.0: 'No'
})

stops_df.loc[:, 'DrugsFound'] = stops_df.loc[:, 'DrugsFound'].map({
    0.0: 'NA',
    1.0: 'Yes',
    2.0: 'No'
})

stops_df.loc[:, 'WeaponFound'] = stops_df.loc[:, 'WeaponFound'].map({
    0.0: 'NA',
    1.0: 'Yes',
    2.0: 'No'
})

**Note**: For storage purposes, it isn't optimal to fill in categorical data types with a long string. Therefore, categories are usually mapped to a single character to save space.

### Statistics

In the exploratory process, it is essential to have an understanding of the distribution of data and its summary statistics. Pandas offers a set of methods that provide this information and additionally, enable us to visualize it.

A few ways to do this includes using `mean()` and `median()` method to get these summary statistics for a DataFrame or a Series. See the cells below:

In [52]:
stops_df.loc[:,'Duration'].mean()

7.579952016990705

In [53]:
stops_df.loc[:,'Duration'].median()

4.0

We got the mean and median duration for all Traffic stops. Depending on the data type, we can gather more of such stats to assist us with our analysis. We can also use the `.describe()` method to provide us with a quick way to see essential summary stats for each column. Notice, that summary stats are only given for numeric columns, therefore, we do not see summary stats for any column with datetime, categorical or object type.

You can also notice that columns that were supposed to have categorical types and were picked up as integer or float data type, got statistical values that are not relevant. For eg. Weekday has mean and percentiles. Therefore, this emphasizes on the relevance of converting such columns to categorical data types.

In [54]:
stops_df.describe()

           Duration       Weekday          Hour
count  76277.000000  76277.000000  76277.000000
mean       7.579952      3.116064     15.491131
std       26.182170      1.958205      6.098630
min        0.000000      0.000000      0.000000
25%        3.000000      1.000000     11.000000
50%        4.000000      3.000000     17.000000
75%        6.000000      5.000000     20.000000
max      719.000000      6.000000     23.000000

The result above displays some simple statistical estimates including mean, count, maximum and minimum value, standard deviation (std) and quartiles for each column. Let's convert Weekday and Hour to categorical variables as required.

In [55]:
stops_df = stops_df.astype({'Weekday': 'category', 
                            'Hour':'category'})

Other significant attributes that give useful information include `value_counts()` which provides count of unique values in a series. We can use it to see the number of stops on each day of the week.<br><br>Note: Pandas weekday attribute maps Monday to 0 and Sunday to 6

In [56]:
stops_df.loc[:,'Weekday'].value_counts()

4    12198
5    11944
3    10899
6    10780
2    10695
1    10405
0     9356
Name: Weekday, dtype: int64

### Pointers and Object References

It is important to know how Pandas objects are treated, especially when they are passed to functions or when changes are made to them. If you are not familiar with the concept, arguments to functions are pass-by-value where Python creates a copy of the variable inside the function and works with that copy.

In [57]:
def square_number(number_in_function):
    number_in_function = number_in_function**2

In [58]:
number = 5
square_number(number)
print(number)

5

The number variable itself doesn't get changed!

However, Pandas objects, particularly DataFrame and Series are passed as pass-by-reference, where the variable **pointing** to the Pandas object is given to the function and, therefore, any changes made to the object the pointer variable is pointing to within the function, also changes the object in place.

![](https://blog.penjee.com/wp-content/uploads/2015/02/pass-by-reference-vs-pass-by-value-animation.gif)

Moreover, any assignment to a new variable such as `df2 = df` just makes the new variable point to the same DataFrame and as a result, any changes made to `df2` will also impact `df` since they both point to the same object.

In [59]:
web_views

      Chrome  Safari  Firefox
2018      67      74       89
2019      44      58       70
2020       8      14       16

In [60]:
web_views2 = web_views

We will change a value in web_views2 to see the impact on web_views.

In [61]:
web_views2.loc[2018, 'Safari'] = 87

In [62]:
web_views

      Chrome  Safari  Firefox
2018      67      87       89
2019      44      58       70
2020       8      14       16

The value in that cell in web_views also changes. Similarly, adding a new row to web_views2 adds it to web_views as well. (As mentioned, they both point to the same dataframe)

In [63]:
web_views2.loc[2021] = [32, 19, 45]
web_views

      Chrome  Safari  Firefox
2018      67      87       89
2019      44      58       70
2020       8      14       16
2021      32      19       45

Passing dataframe as an argument to a function call doesn't create a new copy but changes the DataFrame in-place as it is only passing the reference of the DataFrame object and not the data.

In [64]:
def square_vals(dataframe):
    dataframe[:] = dataframe**2

As a result, passing the dataframe as an argument to the `square_vals()` function will alter the original dataset.

In [65]:
square_vals(web_views)
web_views

      Chrome  Safari  Firefox
2018    4489    7569     7921
2019    1936    3364     4900
2020      64     196      256
2021    1024     361     2025

The process of assigning DataFrame to a new variable using `=` sign doesn't copy the values but just makes the new variable another point of reference for the dataframe. 

Pandas uses a method called shallow copy. This creates a new object where the object will only have references to the original data and its indexes but not the data and the index itself. Any changes to values in a shallow copy will also reflect in the original dataframe. The difference this has with using the assignment operator `=` is that we can append extra rows and columns to the shallow copied DataFrame without affecting the original one. The original DataFrame will only change if we change existing values as we are changing the values that are referred to in both the dataframes.

In [66]:
web_views

      Chrome  Safari  Firefox
2018    4489    7569     7921
2019    1936    3364     4900
2020      64     196      256
2021    1024     361     2025

In [67]:
shallow = web_views.copy(deep=False)

In [68]:
shallow.loc[2020, 'Chrome'] = 80
web_views

      Chrome  Safari  Firefox
2018    4489    7569     7921
2019    1936    3364     4900
2020      80     196      256
2021    1024     361     2025

In [69]:
shallow.loc[2022] = [44, 59, 50]
web_views

      Chrome  Safari  Firefox
2018    4489    7569     7921
2019    1936    3364     4900
2020      80     196      256
2021    1024     361     2025

On the other hand, we can use a deep copy which creats a new object and copies both the data and values to the new object. Therefore, any changes to the deep copy will not be reflected in the original copy.

In [70]:
deep = web_views.copy(deep=True)

In [71]:
deep.loc[2018, 'Firefox'] = 99
deep

      Chrome  Safari  Firefox
2018    4489    7569       99
2019    1936    3364     4900
2020      80     196      256
2021    1024     361     2025

In [72]:
web_views

      Chrome  Safari  Firefox
2018    4489    7569     7921
2019    1936    3364     4900
2020      80     196      256
2021    1024     361     2025

**Note**: It is important to note that within deep copy, data is copied but actual Python objects will not be copied recursively, only the reference to the object. This means that if the cells in the DataFrame contain references to other objects, the references will be copied only and not the objects it refers too.

### Export

In the beginning, we went through how we can import a variety of files and read it as a Pandas object. Similarly, we can make use of writer functions that enable us to save a Pandas object to your computer. For saving DataFrames, a few of the methods that we can use are `.to_csv()` (comma-separated file format), `.to_excel()` (MS Excel format) and `to_pickle()` (Python pickle format). All these methods take the file path as the first argument.

In [73]:
web_views.to_csv('web_views.csv')

We will save the traffic stops dataframe as a Python pickle format. One benefit of doing this is that it preserves the format and types of the DataFrame that can be imported to our next script. However, it is not human-readable as a csv format.

In [74]:
stops_df.to_pickle('stops.pkl')

## Advanced Topics

### Groupby

Groupby is certainly amongst the most useful set of methods in pandas. To make this concept intuitive, we will break it down into its 3 major steps: split-apply-combine.

In the *split* step, the data is divided into groups by a criteria. For eg. we will group our datasets into race groups (6 in this DataFrame). The format for this step is shown below where the `groupby()` method takes the column name to group over as an argument.

In [75]:
RaceGroups = stops_df.groupby('DriverRace')

In the *apply* step, a function is applied to each group that was formed. These are referred to as aggregation functions. We will use an averaging function (mean) to be applied to values in each race group.

The *combine* step then combines and structures the result into a DataFrame. By applying the aggregation function to the grouped data below, we are performing both the apply and combine step.

In [76]:
RaceGroups.mean()

                                           Duration
DriverRace
White                                      7.501639
Black or African American                  7.777141
American Indian or Alaska Native           6.758278
Hispanic or Latino                         7.168813
Asian                                      6.271658
Native Hawaiian or Other Pacific Islander  7.015957

For every numerical column that we have in our dataset, we get a mean value for every group. It surely doesn't make sense to have a mean for every column since some of them contain categories. We can select the column we want to aggregate by specifying along with the group.

In [77]:
RaceGroups['Duration'].mean()

DriverRace
White                                        7.501639
Black or African American                    7.777141
American Indian or Alaska Native             6.758278
Hispanic or Latino                           7.168813
Asian                                        6.271658
Native Hawaiian or Other Pacific Islander    7.015957
Name: Duration, dtype: float64

In order to set the group names as a column, we need to use the `reset_index()` method.

In [78]:
RaceGroups['Duration'].mean().reset_index()

                                  DriverRace  Duration
0                                      White  7.501639
1                  Black or African American  7.777141
2           American Indian or Alaska Native  6.758278
3                         Hispanic or Latino  7.168813
4                                      Asian  6.271658
5  Native Hawaiian or Other Pacific Islander  7.015957

Size is another aggragation function to get the size for each group.

In [79]:
RaceGroups.size()

DriverRace
White                                         7934
Black or African American                    50220
American Indian or Alaska Native               302
Hispanic or Latino                           15763
Asian                                         1870
Native Hawaiian or Other Pacific Islander      188
dtype: int64

We can also groupby multiple columns and chain all these steps in a single line.

In [80]:
multi_level_group = stops_df.groupby(['TypeOfMovingViolation',
                  'DriverRace']).mean()

In [81]:
multi_level_group.head(10)

                                                                  Duration
TypeOfMovingViolation DriverRace
Speed                 White                                       8.500000
                      Black or African American                  18.070496
                      American Indian or Alaska Native            5.000000
                      Hispanic or Latino                         13.543307
                      Asian                                       9.900000
                      Native Hawaiian or Other Pacific Islander  15.000000
Lane Violation        White                                       8.907216
                      Black or African American                   7.950725
                      American Indian or Alaska Native            6.100000
                      Hispanic or Latino                          7.844322

### Multi-level Indexing

In the cell above, we just created a multi-level indexed Series. As the name suggests, multi-level indexing gives us the power to use a hierarchy of indexes to label values in a Pandas DataFrame. This in turn enables us to work with even higher dimensional data and store and manipulate the data in higher dimensions. 

Fortunately, we can use similar indexing techniques as we introduced above to view and manipulate multi-level indexed DataFrame. Instead of using a single label, we would use a tuple of labels to index a subset.

In [82]:
type(multi_level_group.index)

pandas.core.indexes.multi.MultiIndex

In [83]:
multi_level_group.loc[('Lane Violation','White'),'Duration']

8.907216494845361

### Merge

In data manipulation operations, there are situations where we need to combine multiple Series or DataFrames together. It could either be the case of stacking similar DataFrames on top of another or combining a supplementary data with some matching columns to the original DataFrame.

To illustrate this, we are going to perform 2 kinds of operations. The first one involves concatenation where we will stack a DataFrame vertically below the stops DataFrame. This additional DataFrame will be a portion of the DataFrame that we will break off from the stops DataFrame to demonstrate how it can be re-combined.

In [84]:
stops_jan = stops_df.loc[stops_df.loc[:,'DateStop'] < '2021-02-01',:]
stops_feb = stops_df.loc[stops_df.loc[:,'DateStop'] > '2021-01-31',:]

In [85]:
print(stops_jan.shape)
print(stops_feb.shape)

(42705, 12)
(33572, 12)

We will use the `pd.concat()` function to combine. By specifying `axis = 0`, we are ensuring that it concatenates vertically. By printing the shape we can see the final number of rows after re-combination.

In [86]:
stops_combined = pd.concat([stops_jan, stops_feb], axis = 0)
print(stops_combined.shape)

(76277, 12)

The stops DataFrame contains the race of every driver for every stop in a particular police beat. To see if there is involvement of police bias in the traffic stops, we might want to know the proportion of each race group that was stopped relative to their population that beat. For that, we need to know the population of each race group in every beat. Fortunately, we will make use of the Chicago Police beat demographics dataset. In order to find out the proportions of stops per race, we would need to combine both the datasets (the Traffics Stops data and the Beat demographics data) to calculate the proportions. 

We will use merge for this purpose. Merge enables us to use SQL-like commands to combine DataFrames. It's fine if you are not familiar with SQL. The image illustration can offer a good intuition of what each SQL join refers too.

![](https://www.dofactory.com/img/sql/sql-joins.png)

We will first import the Beat demographics dataset 'beat_race.pkl' and then perform an **inner join**. This is also the simple join as shown in the illustration above where only intersecting indexes will be merged. In this example, we will join Beat Code from both the dataset and inner join will ensure that Beat Code existing in both will merge.

In [87]:
beatrace = pd.read_pickle('beat_race.pkl')
beatrace.head()

  BeatCode  White  Hispanic or Latino  Black or African American  Asian
0     0111   1272                 190                         85    413
1     0112    668                  56                        116    204
2     0113    614                  76                        140    211
3     0114  10783                1058                       1246   2736
4     0121   3114                 427                        297   2401

In the code below we will create a grouped DataFrame conisisting of Beat Code as index and sum of each Driver's Race in that beat. We have introduced new notations in the code below but we are going to cover it up in the sections ahead. Right now, you can see the DataFrame we produce.

In [88]:
stops_race_dummies = pd.get_dummies(stops_df, columns = ['DriverRace'])
stops_race_dummies['BeatCode'] = stops_race_dummies['BeatCode'].astype('str').str.zfill(4)
Beat_Race_group = stops_race_dummies.groupby('BeatCode').sum()[stops_race_dummies.columns[11:]]
Beat_Race_group.reset_index(inplace=True)

In [89]:
Beat_Race_group.head()

,BeatCode,DriverRace_White,DriverRace_Black or African American,DriverRace_American Indian or Alaska Native,DriverRace_Hispanic or Latino,DriverRace_Asian,DriverRace_Native Hawaiian or Other Pacific Islander
0,0111,64.0,119.0,3.0,59.0,13.0,2.0
1,0112,43.0,102.0,3.0,30.0,3.0,1.0
2,0113,71.0,93.0,2.0,49.0,13.0,4.0
3,0114,89.0,152.0,5.0,75.0,21.0,2.0
4,0121,22.0,42.0,3.0,14.0,4.0,0.0

We will then use the merge method to do an inner join. The format for a merge function is as follows:

`pandas.merge(left, right, how='inner', on=None, ...)`

Here `left` and `right` are the DataFrames that have to be merged.

In [90]:
beat_merged = pd.merge(Beat_Race_group, beatrace, how = 'inner', on="BeatCode")

You can now see the merged DataFrame where columns in both DataFrame now share a single index 'BeatCode'.

In [91]:
beat_merged.head()

,BeatCode,DriverRace_White,DriverRace_Black or African American,DriverRace_American Indian or Alaska Native,DriverRace_Hispanic or Latino,DriverRace_Asian,DriverRace_Native Hawaiian or Other Pacific Islander,White,Hispanic or Latino,Black or African American,Asian
0,0111,64.0,119.0,3.0,59.0,13.0,2.0,1272,190,85,413
1,0112,43.0,102.0,3.0,30.0,3.0,1.0,668,56,116,204
2,0113,71.0,93.0,2.0,49.0,13.0,4.0,614,76,140,211
3,0114,89.0,152.0,5.0,75.0,21.0,2.0,10783,1058,1246,2736
4,0121,22.0,42.0,3.0,14.0,4.0,0.0,3114,427,297,2401

## Additional Concepts

### Method Chaining

As the name suggests, method chaining enables us to use a series of methods in a single command. This is possible because every method that we use on a pandas object gets returned as a pandas object itself, allowing us to apply another method on it. Method chaining simplies are code and makes it more readable.

Below is an example of how we performed multiple operations using method chaining.

In [92]:
stops_df.groupby(['TypeOfMovingViolation',
                  'DriverRace'])['Duration'].mean().reset_index().head()

  TypeOfMovingViolation                        DriverRace   Duration
0                 Speed                             White   8.500000
1                 Speed         Black or African American  18.070496
2                 Speed  American Indian or Alaska Native   5.000000
3                 Speed                Hispanic or Latino  13.543307
4                 Speed                             Asian   9.900000